jack77er/openUTRUSTA/Packages/.cache/Keil.EFM32WGxxx_DFP.1.2.0.pdsc
    <component Cclass="Device" Cgroup="emdrv" Csub="UARTDRV" Cversion="4.0.0" condition="emdrv UARTDRV">
      <description>Universal Asynchronous Receiver/Transmitter Driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_EMDRV_UARTDRV
      </RTE_Components_h>
      <files>
        <file category="doc"     name="emdrv\emdrvdoc\html\group__UARTDRV.html"/>
        <file category="include" name="emdrv\common\inc\"/>
        <file category="header"  name="emdrv\config\uartdrv_config.h" attr="config" version="4.0.0"/>
        <file category="header"  name="emdrv\uartdrv\inc\uartdrv.h"/>
        <file category="source"  name="emdrv\uartdrv\src\uartdrv.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="emdrv" Csub="USTIMER" Cversion="4.0.0" condition="emdrv USTIMER">
      <description>Micro Second Timer Driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_EMDRV_USTIMER
      </RTE_Components_h>
      <files>
        <file category="doc"     name="emdrv\emdrvdoc\html\group__USTIMER.html"/>
        <file category="include" name="emdrv\common\inc\"/>
        <file category="header"  name="emdrv\config\ustimer_config.h" attr="config" version="4.0.0"/>
        <file category="header"  name="emdrv\ustimer\inc\ustimer.h"/>
        <file category="source"  name="emdrv\ustimer\src\ustimer.c"/>
      </files>
    </component>
emdrv Component not added -->

<!-- glib graphics bundle not added -->

    <bundle Cbundle="EFM32WG-STK3800" Cclass="Board Support" Cversion="4.0.0">
      <description>Silicon Labs EFM32WG-STK3800 Development Kit</description>
      <doc>Boards\SiliconLabs\EFM32WG_STK3800\Documents\efm32wg-stk3800-ug.pdf</doc>

      <component Cgroup="CORE" condition="EFM32WG BSP core">
        <description>Silicon Labs BSP Core</description>
        <RTE_Components_h>
          #define RTE_BOARD_SUPPORT_STK3800
        </RTE_Components_h>
        <files>
          <file category="doc"     name="Boards\SiliconLabs\common\bspdoc\html\index.html"/>
          <file category="header"  name="Boards\SiliconLabs\common\bsp\bsp.h"/>
          <file category="source"  name="Boards\SiliconLabs\common\bsp\bsp_bcc.c"/>
          <file category="source"  name="Boards\SiliconLabs\common\bsp\bsp_stk.c"/>
          <file category="source"  name="Boards\SiliconLabs\common\bsp\bsp_stk_leds.c"/>
          <file category="header"  name="Boards\SiliconLabs\common\bsp\bsp_trace.h"/>
          <file category="source"  name="Boards\SiliconLabs\common\bsp\bsp_trace.c"/>
          <file category="include" name="Boards\SiliconLabs\EFM32WG_STK3800\config\"/>
        </files>
      </component>
<!-- start BSP driver
      <component Cgroup="Drivers" Csub="CapSense" Cvariant="Standard" condition="BSP Driver CapSense">
        <description>CapSense Driver</description>
        <RTE_Components_h>
          #define RTE_BOARD_SUPPORT_DRIVERS_CAPSENSE
        </RTE_Components_h>
        <files>
          <file category="doc"     name="Boards\SiliconLabs\common\bspdoc\html\group__CapSense.html"/>
          <file category="header"  name="Boards\SiliconLabs\common\drivers\capsense.h"/>
          <file category="source"  name="Boards\SiliconLabs\common\drivers\capsense.c"/>
        </files>
      </component>
      <component Cgroup="Drivers" Csub="CapSense"   Cvariant="Low Energy"    condition="BSP Driver CapSense LE">
        <description>CapSense Driver (Low Energy)</description>
        <RTE_Components_h>
          #define RTE_BOARD_SUPPORT_DRIVERS_CAPSENSE_LE
        </RTE_Components_h>
        <files>
          <file category="doc"     name="Boards\SiliconLabs\common\bspdoc\html\group__CapSense.html"/>
          <file category="header"  name="Boards\SiliconLabs\common\drivers\caplesense.h"/>
          <file category="source"  name="Boards\SiliconLabs\common\drivers\caplesense.c"/>
        </files>
      </component>
      <component Cgroup="Drivers" Csub="Display"                             condition="BSP Driver Display">
        <description>Display Driver</description>
        <RTE_Components_h>
          #define RTE_BOARD_SUPPORT_DRIVERS_DISPLAY
        </RTE_Components_h>
        <files>
          <file category="doc"     name="Boards\SiliconLabs\common\bspdoc\html\group__Display.html"/>
          <file category="include" name="glib\"/>
          <file category="header"  name="Boards\SiliconLabs\common\drivers\display.h"/>
          <file category="source"  name="Boards\SiliconLabs\common\drivers\display.c"/>
          <file category="source"  name="Boards\SiliconLabs\common\drivers\displaypalemlib.c"/>
          <file category="source"  name="Boards\SiliconLabs\common\drivers\displayls013b7dh03.c"/>
        </files>
      </component>
      <component Cgroup="Drivers" Csub="DmaCtrl"                             condition="BSP Driver DmaCtrl">
        <description>DmaCtrl Driver</description>
        <RTE_Components_h>
          #define RTE_BOARD_SUPPORT_DRIVERS_DMACTRL
        </RTE_Components_h>
        <files>
          <file category="doc"     name="Boards\SiliconLabs\common\bspdoc\html\group__DmaCtrl.html"/>
          <file category="header"  name="Boards\SiliconLabs\common\drivers\dmactrl.h"/>
          <file category="source"  name="Boards\SiliconLabs\common\drivers\dmactrl.c"/>
        </files>
      </component>
      <component Cgroup="Drivers" Csub="NandFlash"                           condition="BSP Driver NandFlash">
        <description>NandFlash Driver</description>
        <RTE_Components_h>
          #define RTE_BOARD_SUPPORT_DRIVERS_NANDFLASH
        </RTE_Components_h>
        <files>
          <file category="doc"     name="Boards\SiliconLabs\common\bspdoc\html\group__NandFlash.html"/>
          <file category="header"  name="Boards\SiliconLabs\common\drivers\nandflash.h"/>
          <file category="source"  name="Boards\SiliconLabs\common\drivers\nandflash.c"/>
        </files>
      </component>
      <component Cgroup="Drivers" Csub="RetargetIo" Cvariant="Serial"        condition="BSP Driver RetargetIo Serial">
        <description>RetargetIo Driver (Serial)</description>
        <RTE_Components_h>
          #define RTE_BOARD_SUPPORT_DRIVERS_RETARGETIO_SERIAL
        </RTE_Components_h>
        <files>
          <file category="doc"     name="Boards\SiliconLabs\common\bspdoc\html\group__RetargetIo.html"/>
          <file category="source"  name="Boards\SiliconLabs\common\drivers\retargetio.c"/>
          <file category="header"  name="Boards\SiliconLabs\common\drivers\retargetserial.h"/>
          <file category="source"  name="Boards\SiliconLabs\common\drivers\retargetserial.c"/>
        </files>
      </component>
      <component Cgroup="Drivers" Csub="RetargetIo" Cvariant="TextDisplay"   condition="BSP Driver RetargetIo TextDisplay">
        <description>RetargetIo Driver (TextDisplay)</description>
        <RTE_Components_h>
          #define RTE_BOARD_SUPPORT_DRIVERS_RETARGETIO_TEXTDISPLAY
        </RTE_Components_h>
        <files>
          <file category="doc"     name="Boards\SiliconLabs\common\bspdoc\html\group__RetargetIo.html"/>
          <file category="source"  name="Boards\SiliconLabs\common\drivers\retargetio.c"/>
          <file category="header"  name="Boards\SiliconLabs\common\drivers\retargettextdisplay.h"/>
          <file category="source"  name="Boards\SiliconLabs\common\drivers\retargettextdisplay.c"/>
        </files>
      </component>
      <component Cgroup="Drivers" Csub="RtcDrv"                              condition="BSP Driver RtcDrv">
        <description>RtcDrv Driver</description>
        <RTE_Components_h>
          #define RTE_BOARD_SUPPORT_DRIVERS_RTCDRV
        </RTE_Components_h>
        <files>
          <file category="doc"     name="Boards\SiliconLabs\common\bspdoc\html\group__RtcDrv.html"/>
          <file category="header"  name="Boards\SiliconLabs\common\drivers\rtcdrv.h"/>
          <file category="source"  name="Boards\SiliconLabs\common\drivers\rtcdrv.c"/>
        </files>
      </component>
      <component Cgroup="Drivers" Csub="SegmentLcd"                          condition="BSP Driver SegmentLcd">
        <description>SegmentLcd Driver</description>
        <RTE_Components_h>
          #define RTE_BOARD_SUPPORT_DRIVERS_SEGMENTLCD
        </RTE_Components_h>
        <files>
          <file category="doc"     name="Boards\SiliconLabs\common\bspdoc\html\group__SegmentLcd.html"/>
          <file category="header"  name="Boards\SiliconLabs\common\drivers\segmentlcd.h"/>
          <file category="source"  name="Boards\SiliconLabs\common\drivers\segmentlcd.c"/>
        </files>
      </component>
      <component Cgroup="Drivers" Csub="TextDisplay"                         condition="BSP Driver TextDisplay">
        <description>TextDisplay Driver</description>
        <RTE_Components_h>
          #define RTE_BOARD_SUPPORT_DRIVERS_TEXTDISPLAY
        </RTE_Components_h>
        <files>
          <file category="doc"     name="Boards\SiliconLabs\common\bspdoc\html\group__Textdisplay.html"/>
          <file category="header"  name="Boards\SiliconLabs\common\drivers\textdisplay.h"/>
          <file category="source"  name="Boards\SiliconLabs\common\drivers\textdisplay.c"/>
        </files>
      </component>
      <component Cgroup="Drivers" Csub="Udelay"                              condition="BSP Driver Udelay">
        <description>Udelay Driver</description>
        <RTE_Components_h>
          #define RTE_BOARD_SUPPORT_DRIVERS_UDELAY
        </RTE_Components_h>
        <files>
          <file category="doc"     name="Boards\SiliconLabs\common\bspdoc\html\group__Udelay.html"/>
          <file category="header"  name="Boards\SiliconLabs\common\drivers\udelay.h"/>
          <file category="source"  name="Boards\SiliconLabs\common\drivers\udelay.c"/>
        </files>
      </component>
      <component Cgroup="Drivers" Csub="VddCheck"                            condition="BSP Driver VddCheck">
        <description>VddCheck Driver</description>
        <RTE_Components_h>
          #define RTE_BOARD_SUPPORT_DRIVERS_VDDCHECK
        </RTE_Components_h>
        <files>
          <file category="doc"     name="Boards\SiliconLabs\common\bspdoc\html\group__VddCheck.html"/>
          <file category="header"  name="Boards\SiliconLabs\common\drivers\vddcheck.h"/>
          <file category="source"  name="Boards\SiliconLabs\common\drivers\vddcheck.c"/>
        </files>
      </component>
end BSP driver -->

      <component Cgroup="LED" condition="EFM32WG BSP">
        <description>LED interface for Silicon Labs EFM32WG-STK3800 Development Kit</description>
        <files>
          <file category="source"  name="Boards\SiliconLabs\EFM32WG_STK3800\Common\LED_STK3800.c"/>
        </files>
      </component>
      <component Cgroup="Buttons" condition="EFM32WG BSP">
        <description>Buttons interface for Silicon Labs EFM32WG-STK3800 Development Kit</description>
        <files>
          <file category="source"  name="Boards\SiliconLabs\EFM32WG_STK3800\Common\Buttons_STK3800.c"/>
        </files>
      </component>
    </bundle>
  </components>

