jack77er/openUTRUSTA/Packages/.cache/Keil.EFM32WGxxx_DFP.1.2.0.pdsc
  <boards>
    <board vendor="Silicon Labs" name="EFM32WG-STK3800" revision="Ver 1.0">
      <description>Silicon Labs EFM32WG Starter Kit</description>
      <image small="Boards\SiliconLabs\EFM32WG_STK3800\Documents\efm32wg-stk3800_small.jpg"/>
      <book category="manual"    name="Boards\SiliconLabs\EFM32WG_STK3800\Documents\efm32wg-stk3800-ug.pdf" title="User Manual"/>
      <book category="schematic" name="Boards\SiliconLabs\EFM32WG_STK3800\Documents\BRD2400A_A00.pdf"       title="Schematics"/>
      <mountedDevice    deviceIndex="0" Dvendor="Silicon Labs:21" Dname="EFM32WG990F256"/>
      <compatibleDevice deviceIndex="0" Dvendor="Silicon Labs:21" DsubFamily="EFM32WG990"/>
      <feature type="Button"     n="3"             name="Push-buttons: Reset, 2x User"/>
      <feature type="LED"        n="6"             name="LEDs: 4x Status, 2x User"/>
      <feature type="DIO"                          name="Breakout pads for easy access to I/O pins"/>
      <feature type="DIO"                          name="20 pin expansion header"/>
      <feature type="Touch"      n="1"             name="Capacitive touch slider"/>
      <feature type="LCD"        n="1"  m="8.20"   name="160 segment Energy Micro LCD"/>
      <feature type="USB"        n="1"             name="USB Micro-AB (OTG) connector"/>
      <feature type="ROM"        n="1"             name="32 MB NAND-Flash"/>
      <feature type="LightSens"  n="1"             name="Ambient Light Sensor"/>
      <feature type="SensOther"  n="1"             name="Inductive-capacitive metal sensor"/>
      <feature type="PWR"        n="5"             name="USB Powered"/>
      <feature type="Batt"       n="1"             name="CR2032 battery"/>
      <feature type="ODbg"       n="1"             name="Onboard SEGGER J-Link USB debugger"/>
    </board>
  </boards>

  <examples>
    <example name="CMSIS-RTOS Blinky" doc="Abstract.txt" folder="Boards\SiliconLabs\EFM32WG_STK3800\Blinky">
      <description>CMSIS-RTOS based Blinky example</description>
      <board name="EFM32WG-STK3800" vendor="Silicon Labs"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="CMSIS" Cgroup="RTOS"/>
        <category>Getting Started</category>
        <category>CMSIS-RTX</category>
      </attributes>
    </example>
  </examples>

</package>
